load testing/createActivityTest.yml
config:
  target: 'http://localhost:3119/note'

  phases:
    - duration: 60
      arrivalRate: 100
  defaults:
    headers:
      content-type: 'application/json'
scenarios:
  - flow:
    - post:
        url: "/create"
        json:
          '@context': ""
          name: "Note title"
          type: "Note"
          id: "Note_{{$randomNumber(1,10000)}}"
          actor: "Actor"
          content: "Content of the note"